_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРасценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_МетодыРасчетаЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_МетодыРасчетаЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БазисноИндексный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурсный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_УровеньЗаданияИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_УровеньЗаданияИндексов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СпособыРасчетаИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СпособыРасчетаИндексов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПолнойСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЭлементамЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_СметаКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РаботаСоСправочниками

// Опускает или поднимает элементы списка справочника.
// Если неопределено, то элемента до/после нет.
//
// Параметры:
//     ТипСправочника 			- Строка	- имя метаданных справочника.
//     ЭлементУменьшаемыйНомер 	- Произвольный	- элемент, у которого уменьшается номер.
//     ЭлементУвеличиваемыйНомер - Произвольный	- элемент, у которого увеличивается номер.
//     РеквизитСортировки 		- Строка	- имя метаданных реквизита, по которому происходит движение.
//     Родитель 				- СправочникСсылка	- Группа справочника, в пределах которой происходит движение.
//
Процедура ВверхВнизСправочник(ТипСправочника, ЭлементУменьшаемыйНомер, ЭлементУвеличиваемыйНомер, РеквизитСортировки, Родитель = Неопределено) Экспорт
	
	Если (Не ЗначениеЗаполнено(ЭлементУменьшаемыйНомер)) ИЛИ (Не ЗначениеЗаполнено(ЭлементУвеличиваемыйНомер)) Тогда
		Возврат;
	Иначе
		СМ_СметаВызовСервера.ВверхВнизСправочник(ТипСправочника, ЭлементУменьшаемыйНомер, ЭлементУвеличиваемыйНомер, РеквизитСортировки, Родитель);
	КонецЕсли;
	
КонецПроцедуры

// Предупреждает пользователя о том, что справочник не нужно редактировать без крайней надобности.
//
// Параметры:
//     Отказ 	- Булево - если Истина, продолжать не следует.
//     Ссылка 	- СправочникСсылка - ссылка на текущий элемент справочника.
//     ИмяФормы - Строка - содержит имя формы, из которой задается вопрос.
//     Текст 	- Строка - текст предупреждения (если требуется особенный текст).
//
Процедура ЗадатьВопрос(Отказ, Ссылка, ИмяФормы, Текст = "") Экспорт
	
	Отказ = Истина;
	Структура = Новый Структура;
	Структура.Вставить("Отказ", Отказ);
	Структура.Вставить("Ссылка", Ссылка);
	Структура.Вставить("ИмяФормы", ИмяФормы);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьЭлемент", СМ_СметаКлиент, Структура);
	ПоказатьВопрос(ОписаниеОповещения, ?(ЗначениеЗаполнено(Текст), Текст, НСтр("ru='Данный справочник является внутренним, Вы уверены, что хотите отредактировать его?'")), РежимДиалогаВопрос.ДаНет,0,,"Внимание");
	
КонецПроцедуры

// Используется для события ответа на вопрос пользователя из процедуры ЗадатьВопрос.
//
// Параметры:
//     Результат 			- КодВозвратаДиалога - ответ пользователя.
//     СтруктураПараметров 	- Структура - содержит параметры, передаваемые при вызове.
//
Процедура ОткрытьЭлемент(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураПараметров.Ссылка) Тогда
		ПоказатьЗначение(, СтруктураПараметров.Ссылка);
	Иначе
		ОткрытьФорму(СтруктураПараметров.ИмяФормы);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает строковое представление формулы.
//
// Параметры:
//     СтрТекста - Строка - текст формулы.
//
// Возвращаемое значение:
//     ОписаниеФормулы - Строка - содержит красивое представление формулы.
//
Функция ПолучитьОписаниеФормулы(СтрТекста) Экспорт  
	СтрДействий = "+-";
	ФормулаЛЗ = СтрТекста;
	ОписаниеФормулы = "";
	Действие = "";
	ФормулаЛЗ = СокрЛП(СтрЗаменить(ФормулаЛЗ," ","")); 
	Если СтрДлина(ФормулаЛЗ) = 0 Тогда Возврат(ОписаниеФормулы); КонецЕсли;
	Пока  СтрДлина(ФормулаЛЗ) <> 0  Цикл
		Поз = 0;
		Для Сч = 1 По СтрДлина(ФормулаЛЗ) Цикл
			ТекСимв = Сред(ФормулаЛЗ,сч,1);
			Если Найти(СтрДействий,ТекСимв) = 0 Тогда Продолжить;
			Иначе
				Поз = Сч;
				Прервать;
			КонецЕсли;	
		КонецЦикла;		
		Если Поз = 0 Тогда
			Итог = ФормулаЛЗ;
			Действие = "";
			ФормулаЛЗ = "";
		Иначе
			Итог = Сред(ФормулаЛЗ,1,Поз - 1);
			Действие = Сред(ФормулаЛЗ, Поз, 1);
			ФормулаЛЗ = Сред(ФормулаЛЗ, Поз + 1);
		КонецЕсли;
		Если Сред(Итог,1,1) = "И" Тогда
			НаимИтога = СМ_СметаВызовСервера.ПолучитьНаименованиеПоИдентификатору("СМ_ИтогиПоГлавам",Итог);	
			ОписаниеФормулы = ОписаниеФормулы + "  " + СокрЛП(НаимИтога)+ "  " + Действие ;
		ИначеЕсли Сред(Итог,1,1) = "Л" Тогда
			НаимИтога = СМ_СметаВызовСервера.ПолучитьНаименованиеПоИдентификатору("СМ_ЛимитированныеЗатраты",Итог);	
			ОписаниеФормулы = ОписаниеФормулы + "  " + СокрЛП(НаимИтога)+ "  " + Действие ;
		КонецЕсли;
	КонецЦикла;
	Возврат(ОписаниеФормулы);
КонецФункции

// Инициирует ценовые показатели ресурсов.
//
// Параметры:
//     ТекРесурс 					- Справочник.СМ_Ресурсы	- ссылка на ресурс.
//     Район 						- Справочник.СМ_ТерриториальныеРайоны - ссылка на район.
//     ИмяФайлаСборникаТекущихЦен 	- Строка - содержит имя файла текущих цен из ВНБ.
//     КодРегиональнойБазы 			- Строка - двухсимвольный код для обновления по ВНБ.
//     СтруктураЦен 				- Структура - содержит поля:
//			* БазиснаяЦена 					- Число	- базисная цена ресурса.
//			* БазиснаяЗарплатаМашинистов    - Число	- базисная заработная плата машинистов.
//			* ТекущаяЦена                   - Число	- текущая цена ресурса.
//			* ТекущаяЗарплатаМашинистов		- Число	- текущая заработная плата машинистов.
//
Процедура ПолучитьЦеныНовогоРесурса(ТекРесурс,Район,ИмяФайлаСборникаТекущихЦен,КодРегиональнойБазы,СтруктураЦен) Экспорт
	
	Если ТипЗнч(СтруктураЦен) <> Тип("Структура") Тогда
		СтруктураЦен = Новый Структура();
		СтруктураЦен.Вставить("БазиснаяЦена");
		СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
		СтруктураЦен.Вставить("ТекущаяЦена");
		СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
	КонецЕсли;         	
	КодРесурса = СокрЛП(СМ_СметаВызовСервера.НайтиКод(ТекРесурс));
	КодРайона = СокрЛП(СМ_СметаВызовСервера.НайтиКод(Район));
	
	ТекЦена = 0;
	ТекЦенаЗПМ = 0;
	Данные = СметнаяКомпонента.ПолучитьТекущиеЦены(КодРесурса, КодРайона, КодРегиональнойБазы, ИмяФайлаСборникаТекущихЦен);
	
	СМ_СметаЗагрузкаВызовСервера.ПолучитьЦенуРесурса(Данные, СтруктураЦен);
	
КонецПроцедуры	

#КонецОбласти

#Область ИнициализацияСметнойПодсистемы

// Процедура подключения сметной компоненты. 
//
// Параметры:
//     Нет.
//
Процедура СметнаяПодсистемаПриЗапуске() Экспорт
	
	// Судариков чтобы работала система
	// СМ_ЗащитаКлиент.Запуск();
	
	СМ_ВерсияКомпоненты = 0;
	
	// СМ_СметаВызовСервера.ВыполнитьНастройкуПанелей();
	
	#Если ВебКлиент Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нормативная база недоступна из веб браузера..'"));
		СметнаяКомпонента = Неопределено;
		Возврат;
	#КонецЕсли
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СметнаяКомпонентаПриЗавершенииПодключения", СМ_СметаКлиент);

	Попытка
		НачатьПодключениеВнешнейКомпоненты(ОписаниеОповещения, "AddIn.Base");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

// Процедура инициализации сметной компоненты и заполнение данных из ВНБ. 
//
// Параметры:
//	   Подключено				- Булево	- результат подключения сметной компоненты.
//	   ДополнительныеПараметры  - Структура - содержит дополнительные параметры.
//
Процедура СметнаяКомпонентаПриЗавершенииПодключения(Подключено, ДополнительныеПараметры) Экспорт
	
	Попытка
		СметнаяКомпонента = Новый("AddIn.BaseSmeta");		
	Исключение
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если СметнаяКомпонента = Неопределено Тогда
		Событие = НСтр("ru = 'Нормативная база недоступна'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
		Возврат;
	КонецЕсли;
	
	ПараметрыСвойств = СМ_СметаВызовСервера.ПараметрыСвойствСметнойКомпоненты();
	
	Попытка
		СМ_ВерсияКомпоненты = Число(СметнаяКомпонента.Version);
	Исключение
		СМ_ВерсияКомпоненты = 1;
	КонецПопытки;

	// Если не заполнены данные - предложить заполнить и выполнять не имеет смысла.
	Если (СМ_ВерсияКомпоненты = 1) Тогда
		Если ((Не (ЗначениеЗаполнено(ПараметрыСвойств.ДиректорияНорм))) ИЛИ (Не (ЗначениеЗаполнено(ПараметрыСвойств.ВариантУстановки))) И (СметнаяКомпонента <> Неопределено)) Тогда
			ПараметрыФ = Новый Структура("ДляВнешнейБазы", Истина);
			ОткрытьФорму("ОбщаяФорма.СМ_НастройкиСмета", ПараметрыФ);
			Событие = НСтр("ru='Настройте параметры внешней нормативной базы для корректной работы с нормативами'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СметнаяКомпонента, ПараметрыСвойств);
	
	ОбновлениеСНБ = Новый Структура("Обновить,СписокСНБ",Истина,неопределено);
	
	СНБЗаполнена = Ложь;
		
	Попытка
		ДанныеВНБ = СметнаяКомпонента.ПровестиОбновлениеСНБ();	
	Исключение
		Возврат;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ДанныеВНБ) Тогда
		Возврат;
	КонецЕсли;
	
	Если СМ_СметаВызовСервера.ПраваНаОбновление() Тогда
	
		СписокСНБ = СМ_СметаЗагрузкаВызовСервера.ПолучитьСписокСНБДляОбновления(ДанныеВНБ, СМ_ВерсияКомпоненты);
		
		Если СписокСНБ.СНБЗаполнена Тогда
			ОбновлениеСНБ.СписокСНБ = СписокСНБ.МассивСНБ;
			ОбновлениеСНБ.Обновить = ?(СписокСНБ.МассивСНБ.Количество()>0,Истина,Ложь);
		КонецЕсли;
		
		Если ОбновлениеСНБ.Обновить Тогда
			Если Не СписокСНБ.МассивСНБ.Найти("RK") = Неопределено Тогда
				 СМ_СметаЗагрузкаВызовСервера.КЗ_ЗагрузкаПриПервомСтарте();
			КонецЕсли;
			СМ_СметаЗагрузкаКлиент.ОбновитьСНБ(ОбновлениеСНБ.СписокСНБ, СметнаяКомпонента, СМ_ВерсияКомпоненты);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура деинициализации сметной компоненты и освобождения лицензии при завершении работы. 
Процедура СметнаяПодсистемаПриЗавершении() Экспорт
	
	// Судариков чтобы работала система
	СМ_ЗащитаКлиент.Стоп();
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПозициями

// Используется для создания неучтенных ресурсов после закрытия формы их редактирования.
//
// Параметры:
//     ВходныеПараметры - Структура - содержит ссылку на таблицу (результат функции ПолучитьСтруктуруНеучтенныхРесурсов)
//                        во внутреннем хранилище.    
//     Параметры 		- Структура - дополнительные параметры обработки.
//
Процедура СоздатьПозицииПоНеучтеннымРесурсамИПоПроекту(ВходныеПараметры,Параметры = неопределено) Экспорт
	
	МассивСмет = СМ_СметаВызовСервера.СоздатьПозицииПоНеучтеннымРесурсамИПоПроекту(ВходныеПараметры, Параметры);
	
	Для Каждого Смета Из МассивСмет Цикл
		
		СписокДействий = Новый Массив;
		СписокДействий.Добавить("ПеренумероватьДерево");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СписокДействий",СписокДействий);
		СтруктураПараметров.Вставить("Смета",Смета);
		СтруктураПараметров.Вставить("НовыйОбъект",Неопределено);

		Оповестить("ОбновитьДеревоСметы",СтруктураПараметров);
		
	КонецЦикла;	
	
КонецПроцедуры

// Открывает окно работы с неучтенными ресурсами.
// Возвращает ложь или истина, удалось открыть или нет.
//
// Параметры:
//     ТаблицаРесурсов 	- ТаблицаЗначений - специально подготовленная таблица с неучтенными ресурсами (и по проекту).
//	   НадоОбновлять 	- Булево - определяет нужно ли обновление дерева состава после подбора ресурсов или нет.
//     НеОткрывать      - Булево - определяет открывать или не открывать форму подбора.
//
Процедура ОткрытьФормуПодбораНеучтенныхРесурсов(ТаблицаРесурсов,НадоОбновлять = Истина,НеОткрывать = Ложь) Экспорт
	
	Если ТаблицаРесурсов<>Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьПозицииПоНеучтеннымРесурсамИПоПроекту",СМ_СметаКлиент);
		
		ПараметрыДляФормыВыбора = Новый Структура("СтруктураПараметров", ТаблицаРесурсов);
		Пар = Новый Структура("Параметры,НеОткрывать", ПараметрыДляФормыВыбора,НеОткрывать);
		ОткрытьФорму("Документ.СМ_ЛокальнаяСмета.Форма.ФормаВыбораРесурсовУпр",Пар,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		НадоОБновлять = Истина;
	Иначе
		НадоОБновлять = Ложь;
	КонецЕсли;
				
КонецПроцедуры

// Инициирует структуру данных для описания неучтенного ресурса и возвращает ее.
//
// Параметры:
//     Позиция 						- ДокументСсылка.СМ_ПозицияЛокальнойСметы - позиция, которой подчинен ресурс.
//     СтруктураПараметровРасчета 	- Структура - содержит данные о смете, полученная вызовом
//                                    ПолучитьСтруктуруПараметровРасчетаЛС().
//
// Возвращаемое значение:
//     ПараметрыПоиска - Структура - содержит поля описания ресурсов (состав полей см. в теле функции).
//
Функция ИнициироватьСтруктуруОписанияРесурса(Позиция, СтруктураПараметровРасчета = Неопределено) Экспорт
	
	Если (СтруктураПараметровРасчета = Неопределено) Тогда
		СтруктураПараметровРасчета = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,Позиция);	
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Ресурс");
	ПараметрыПоиска.Вставить("РегиональнаяБаза", ?(ЗначениеЗаполнено(Позиция.РегиональнаяБаза),Позиция.РегиональнаяБаза,СтруктураПараметровРасчета.РегионДляВыбораЦен));
	ПараметрыПоиска.Вставить("Район", СтруктураПараметровРасчета.Район);
	ПараметрыПоиска.Вставить("ДатаТекущихЦен", СтруктураПараметровРасчета.ДатаТекущихЦен);
	Если СтруктураПараметровРасчета.ФайлСборникаТекущихЦен = "" Тогда
		ПараметрыПоиска.Вставить("ЗагружатьТекущиеЦены", СтруктураПараметровРасчета.АвтозагрузкаЦен);
	Иначе
		ПараметрыПоиска.Вставить("ЗагружатьТекущиеЦены", Ложь);
	КонецЕсли;
	ПараметрыПоиска.Вставить("ФайлСборникаТекущихЦен", СтруктураПараметровРасчета.ФайлСборникаТекущихЦен);
	ПараметрыПоиска.Вставить("КодРегионаФайлаТекущихЦен", СтруктураПараметровРасчета.КодРегионаФайлаТекущихЦен);
	ПараметрыПоиска.Вставить("НеИндексировать", Ложь);
	ПараметрыПоиска.Вставить("БазиснаяЦена", 0);
	ПараметрыПоиска.Вставить("ТекущаяЦена", 0);
	ПараметрыПоиска.Вставить("БазиснаяЗарплМаш", 0);
	ПараметрыПоиска.Вставить("ТекущаяЗарплМаш", 0);
	ПараметрыПоиска.Вставить("Код", "");
	ПараметрыПоиска.Вставить("ВидРесурса");
	ПараметрыПоиска.Вставить("ТипМатериала");
	ПараметрыПоиска.Вставить("ЕдИзм");
	ПараметрыПоиска.Вставить("Норма");
	ПараметрыПоиска.Вставить("Раздел",Позиция.ИДРодителя); 
	ПараметрыПоиска.Вставить("Владелец",Позиция);
	ПараметрыПоиска.Вставить("НаименованиеРесурса"); 
	ПараметрыПоиска.Вставить("ЕдиницаИзмеренияРесурса");
	ПараметрыПоиска.Вставить("РегионДляВыбораЦен", СтруктураПараметровРасчета.РегионДляВыбораЦен); 
	
	Возврат ПараметрыПоиска;
	
КонецФункции

// Инициирует структуру данных для описания неучтенного ресурса и возвращает ее.
//
// Параметры:
//     Смета 						- ДокументСсылка.СМ_ЛокальнаяСмета - смета, из которой идёт вызов.
//     ИДРодителя					- СправочникСсылка.СМ_РазделыЛокальнойСметы - ссылка на раздел родитель.
//     СтруктураПараметровРасчета 	- Структура - содержит данные о смете, полученная вызовом
//                                    ПолучитьСтруктуруПараметровРасчетаЛС().
//
// Возвращаемое значение:
//     ПараметрыПоиска - Структура - содержит поля описания ресурсов (состав полей см. в теле функции).
//
Функция ИнициироватьСтруктуруОписанияРесурсаСмета(Смета, ИДРодителя, СтруктураПараметровРасчета = Неопределено) Экспорт
	
	Если (СтруктураПараметровРасчета = Неопределено) Тогда
		СтруктураПараметровРасчета = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Смета.Ссылка);	
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Ресурс");
	ПараметрыПоиска.Вставить("РегиональнаяБаза", СтруктураПараметровРасчета.РегионДляВыбораЦен);
	ПараметрыПоиска.Вставить("Район", СтруктураПараметровРасчета.Район);
	ПараметрыПоиска.Вставить("ДатаТекущихЦен", СтруктураПараметровРасчета.ДатаТекущихЦен);
	Если Не СтруктураПараметровРасчета.ФайлСборникаТекущихЦен = "" Тогда
		ПараметрыПоиска.Вставить("ЗагружатьТекущиеЦены", СтруктураПараметровРасчета.АвтозагрузкаЦен);
	Иначе
		ПараметрыПоиска.Вставить("ЗагружатьТекущиеЦены", Ложь);
	КонецЕсли;
	ПараметрыПоиска.Вставить("ФайлСборникаТекущихЦен", СтруктураПараметровРасчета.ФайлСборникаТекущихЦен);
	ПараметрыПоиска.Вставить("КодРегионаФайлаТекущихЦен", СтруктураПараметровРасчета.КодРегионаФайлаТекущихЦен);
	ПараметрыПоиска.Вставить("НеИндексировать", Ложь);
	ПараметрыПоиска.Вставить("БазиснаяЦена", 0);
	ПараметрыПоиска.Вставить("ТекущаяЦена", 0);
	ПараметрыПоиска.Вставить("БазиснаяЗарплМаш", 0);
	ПараметрыПоиска.Вставить("ТекущаяЗарплМаш", 0);
	ПараметрыПоиска.Вставить("Код", "");
	ПараметрыПоиска.Вставить("ВидРесурса");
	ПараметрыПоиска.Вставить("ТипМатериала");
	ПараметрыПоиска.Вставить("ЕдИзм");
	ПараметрыПоиска.Вставить("Норма");
	ПараметрыПоиска.Вставить("Раздел",ИДРодителя); 
	ПараметрыПоиска.Вставить("Владелец");
	ПараметрыПоиска.Вставить("НаименованиеРесурса"); 
	ПараметрыПоиска.Вставить("ЕдиницаИзмеренияРесурса");

	Возврат ПараметрыПоиска;
	
КонецФункции

// Возвращает строку с информацией о локальной смете.
//
// Параметры:
//     Документ 	- ДокументОбъект, ДокументСсылка - текущий документ (объект или ссылка).
//     ПараметрыЛС 	- СтрокаДереваЗначений - строка дерева смет.
//     Префикс 		- Строка - то, что будет добавляться перед описанием.
//     Смета 		- ДокументСсылка - если известна смета - можно передать ее.
//
// Возвращаемое значение:
//     СтрокаИнформации - Строка - описывает смету (номер, наименование и т.п.).
//
Функция ПолучитьТекстИнформацииОСмете(Документ, ПараметрыЛС = Неопределено, Префикс = "Смета", Смета = Неопределено) Экспорт
	
	Если (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))
		ИЛИ (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот"))
		ИЛИ (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))
		ИЛИ (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")) Тогда
		СтрокаИнформации = СМ_СметаВызовСервера.ПолучитьТекстИнформацииОСмете(Документ, ПараметрыЛС, Префикс, Смета);
	Иначе // Это данные формы, обойдемся без сервера.
			
		Если ПараметрыЛС = Неопределено Тогда
			ПараметрыЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Смета, Документ);
		КонецЕсли;
		
		СтрокаИнформации = Префикс;
		
		Если ПараметрыЛС.ЭтоРесурсныйМетод Тогда
			СтрокаИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 №%2 %3 (ресурсный метод)'"), СтрокаИнформации, ПараметрыЛС.НомерСметы, ПараметрыЛС.Наименование);
		ИначеЕсли ПараметрыЛС.ЭтоБазисноИндексныйУровеньРасценка Тогда
			СтрокаИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 №%2 %3 (базисно-индексный метод, индексы по позиции)'"), СтрокаИнформации, ПараметрыЛС.НомерСметы, ПараметрыЛС.Наименование);
		ИначеЕсли ПараметрыЛС.ЭтоБазисноИндексныйУровеньРаздел Тогда
			СтрокаИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 №%2 %3 (базисно-индексный метод, индексы по разделам)'"), СтрокаИнформации, ПараметрыЛС.НомерСметы, ПараметрыЛС.Наименование);
		ИначеЕсли ПараметрыЛС.ЭтоБазисноИндексныйУровеньСмета Тогда
			СтрокаИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 №%2 %3 (базисно-индексный метод, индексы по смете)'"), СтрокаИнформации, ПараметрыЛС.НомерСметы, ПараметрыЛС.Наименование);
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат СтрокаИнформации;
	
КонецФункции

// Возвращает строку с инофрмацией об акте выполненных работ.
//
// Параметры:
//     Документ 	- ДокументОбъект, ДокументСсылка - текущий документ акт (объект или ссылка).
//     ПараметрыЛС 	- СтрокаДереваЗначений - строка дерева смет.
//     Префикс 		- Строка - то, что будет добавляться перед описанием.
//     Смета 		- ДокументСсылка - если известна смета - можно передать ее.
//
// Возвращаемое значение:
//     СтрокаИнформации - Строка - описывает Акт (номер, наименование и т.п.).
//
Функция ПолучитьТекстИнформацииОбАкте(Документ, ПараметрыЛС, Префикс = "Акт", Смета = Неопределено) Экспорт
	
	Если (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))
		ИЛИ (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот"))
		ИЛИ (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))
		ИЛИ (ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")) Тогда
		СтрокаИнформации = СМ_СметаВызовСервера.ПолучитьТекстИнформацииОбАкте(Документ, ПараметрыЛС, Префикс, Смета);
	Иначе // Это данные формы, обойдемся без сервера.
		
		Если ПараметрыЛС = Неопределено Тогда
			Если ЗначениеЗаполнено(Смета) Тогда
				ПараметрыЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Смета);
			ИначеЕсли ЗначениеЗаполнено(Документ.ЛокальнаяСмета) Тогда
				ПараметрыЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Документ.ЛокальнаяСмета);
			Иначе
				ПараметрыЛС = Неопределено;
				Возврат Префикс;
			КонецЕсли;
		КонецЕсли;
					
		СтрокаИнформации = Префикс;
		
		Если ПараметрыЛС.ЭтоРесурсныйМетод Тогда
			СтрокаИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 №%2 %3 (ресурсный метод)'"), СтрокаИнформации, Документ.НомерАкта, ПараметрыЛС.Наименование);
		ИначеЕсли ПараметрыЛС.ЭтоБазисноИндексныйУровеньРасценка Тогда
			СтрокаИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 №%2 %3 (базисно-индексный метод, индексы по позиции)'"), СтрокаИнформации, Документ.НомерАкта, ПараметрыЛС.Наименование);
		ИначеЕсли ПараметрыЛС.ЭтоБазисноИндексныйУровеньРаздел Тогда
			СтрокаИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 №%2 %3 (базисно-индексный метод, индексы по разделам)'"), СтрокаИнформации, Документ.НомерАкта, ПараметрыЛС.Наименование);
		ИначеЕсли ПараметрыЛС.ЭтоБазисноИндексныйУровеньСмета Тогда
			СтрокаИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 №%2 %3 (базисно-индексный метод, индексы по смете)'"), СтрокаИнформации, Документ.НомерАкта, ПараметрыЛС.Наименование);
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат СтрокаИнформации;
	
КонецФункции

// Возвращает строку с информацией о разделе.
//
// Параметры:
//     Раздел - ДокументСсылка.СМ_РазделЛокальнойСметы, ДокументОбъект.СМ_РазделЛокальнойСметы - 
//				текущий документ Раздел (объект или ссылка).
//
// Возвращаемое значение:
//     СтрокаИнформации - Строка - описывает раздел (номер, наименование и т.п.).
//
Функция ПолучитьТекстИнформацииОРазделе(Раздел) Экспорт
	
	Если (ТипЗнч(Раздел) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))
		ИЛИ (ТипЗнч(Раздел) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот"))
		ИЛИ (ТипЗнч(Раздел) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))
		ИЛИ (ТипЗнч(Раздел) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")) Тогда
		СтрокаИнформации = СМ_СметаВызовСервера.ПолучитьТекстИнформацииОРазделе(Раздел);
	Иначе // Это данные формы, обойдемся без сервера.
		СтрокаИнформации = ""+ СокрЛП(Раздел.ПорНомер) + ".  " + СокрЛП(Раздел.НаименованиеДляПечати);
	КонецЕсли;
	
	Возврат СтрокаИнформации;
	
КонецФункции

// Возвращает строку с информацией о позиции.
//
// Параметры:
//     Позиция - ДокументСсылка.СМ_ПозицияЛокальнойСметы, ДокументОбъект.СМ_ПозицияЛокальнойСметы - 
//				 текущий документ Позиция (объект или ссылка).
//
// Возвращаемое значение:
//     СтрокаИнформации - Строка - описывает Позицию (номер, наименование и т.п.).
//
Функция ПолучитьТекстИнформацииОПозиции(Позиция) Экспорт
	
	Если (ТипЗнч(Позиция) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))
		ИЛИ (ТипЗнч(Позиция) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот"))
		ИЛИ (ТипЗнч(Позиция) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))
		ИЛИ (ТипЗнч(Позиция) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")) Тогда
		СтрокаИнформации = СМ_СметаВызовСервера.ПолучитьТекстИнформацииОПозиции(Позиция);
	Иначе // Это данные формы, обойдемся без сервера.
		СтрокаИнфомрации = ""+ СокрЛП(Позиция.ПорНомер) + ". " + СокрЛП(Позиция.ШифрРасценки) + "   " + СокрЛП(Позиция.Наименование);
	КонецЕсли;
	
	Возврат СтрокаИнформации;
	
КонецФункции

// Выполняет вызов форм выбора справочников. 
//
// Параметры:
//     Параметры - Структура - набор необходимых параметров.
//
Процедура ВыполнитьЗаменуРесурса(Параметры) Экспорт
	Если Параметры.ВариантЗамены = Неопределено Тогда
		ПолучитьЗаменуРесурса(НСтр("ru='ВНБ'"), Параметры);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПолучитьЗаменуРесурса", СМ_СметаКлиент,Параметры);
		Если Параметры.Свойство("ЗаменяемыйРесурс") Тогда
			ПараметрыФормыВыбора = Новый Структура;
			ПараметрыФормыВыбора.Вставить("ТекРесурс",Параметры.ЗаменяемыйРесурс);
		КонецЕсли;
		ОткрытьФорму("Справочник."+Параметры.ВариантЗамены+".Форма.ФормаВыбора",ПараметрыФормыВыбора,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

// Обрабатывает выбранное значение замены и оставляет из множественного списка только один ресурс. 
//
// Параметры:
//     Результат - Массив, СправочникСсылка.СМ_Ресурсы, СправочникСсылка.СМ_НормативныеСборники - 
//				   выбранное значение, либо "ВНБ" в случае замены из внешней программы.
//
// Возвращаемое значение:
//     Ресурс - СправочникСсылка.СМ_Ресурсы, Неопределено - ссылка на выбранное значение или Неопределено.
//
Функция ПолучитьОдинРесурсИзМассива(Результат) Экспорт
	
	Ресурс = Неопределено;
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Ресурс	= Результат[0];
	ИначеЕсли (ТипЗнч(Результат) = Тип("СправочникСсылка.СМ_Ресурсы")) или (ТипЗнч(Результат) = Тип("СправочникСсылка.СМ_НормативныеСборники")) Тогда
		Если Не СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Результат, "ЭтоГруппа") Тогда
			Ресурс	= Результат;
		КонецЕсли;
	Иначе
		Ресурс = Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ресурс) Тогда
		Возврат Неопределено;
	Иначе
		Возврат Ресурс;
	КонецЕсли;

КонецФункции

// Обрабатывает выбранное значение замены и оставляет из множественного списка только один ресурс 
// (если в массиве он один) или возвращает сам массив (если два и более). 
//
// Параметры:
//     Результат - Массив, СправочникСсылка.СМ_Ресурсы, СправочникСсылка.СМ_НормативныеСборники - 
//				   выбранное значение, либо "ВНБ" в случае замены из внешней программы.
//
// Возвращаемое значение:
//     Результат - СправочникСсылка.СМ_Ресурсы, Массив, Неопределено - ссылка на выбранное значение или Массив.
Функция ПолучитьОдинРесурсИлиМассив(Результат) Экспорт
	
	Ресурс = Неопределено;
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Если Результат.Количество() > 1 Тогда
			Возврат Результат;
		Иначе
			Возврат Результат[0];
		КонецЕсли;
	ИначеЕсли (ТипЗнч(Результат) = Тип("СправочникСсылка.СМ_Ресурсы")) или (ТипЗнч(Результат) = Тип("СправочникСсылка.СМ_НормативныеСборники")) Тогда
		Если Не Результат.ЭтоГруппа Тогда
			Возврат Результат;
		Иначе
			Возврат Неопределено
		КонецЕсли;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

// Обрабатывает выбранное значение замены. 
//
// Параметры:
//     Структура - Структура - набор необходимых параметров.
//     Результат - СправочникСсылка.СМ_Ресурсы, СправочникСсылка.СМ_НормативныеСборники - 
//				   выбранное значение, либо "ВНБ" в случае замены из внешней программы.
//
Процедура ПолучитьЗаменуРесурса(Результат, Структура) Экспорт
	
	Структура.Ресурс	= ПолучитьОдинРесурсИзМассива(Результат);
	
	Если Не ЗначениеЗаполнено(Структура.Ресурс) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Структура.Ресурс) = Тип("СправочникСсылка.СМ_НормативныеСборники") Тогда
		Определитель = СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Структура.Ресурс,"Определитель");
		ВидРасценки = СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Определитель,"ВидРасценки");
		Если ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Транспортировка")
			ИЛИ ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Работа") Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("Продолжить_ПолучитьЗаменуРесурса", СМ_СметаКлиент, Структура);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Выбран не материал. Продолжить?';"
			+ " en = 'Do you want to continue?'"), Режим, 0);
		Иначе
			Продолжить_ПолучитьЗаменуРесурса(КодВозвратаДиалога.Да, Структура);
		КонецЕсли;
	Иначе
		Продолжить_ПолучитьЗаменуРесурса(КодВозвратаДиалога.Да, Структура);
	КонецЕсли;
КонецПроцедуры

// Продолжает обработку выбранного значения замены. 
//
// Параметры:
//     Результат - КодВозвратаДиалога - ответ пользователя на вопрос о замене ресурса.
//     Структура - Структура - набор необходимых параметров.
//
Процедура Продолжить_ПолучитьЗаменуРесурса(Результат, Структура) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ВыполнитьЗаменуРесурса(Структура);
        Возврат;
    КонецЕсли;
	
	// Получение текущих и базисных цен
	СтруктураЦен = Новый Структура();
	СтруктураЦен.Вставить("БазиснаяЦена");
	СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
	СтруктураЦен.Вставить("ТекущаяЦена");
	СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
	СтруктураДопПараметров = Новый Структура();
	СтруктураДопПараметров.Вставить("Район");
	СтруктураДопПараметров.Вставить("ДатаТекущихЦен");
	СтруктураДопПараметров.Вставить("ФайлТекущихЦен");
	СтруктураДопПараметров.Вставить("АвтозагрузкаЦен");
	СтруктураДопПараметров.Вставить("КодРегионаФайлаТекущихЦен");
	
	Если Структура.ПозицияРесурса.Пустая() = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбрана позиция-владелец ресурса'"));
		Возврат;
	КонецЕсли;
	Форма = Структура.Форма;
	Структура.Удалить("Форма");
	Если Структура.ВариантЗамены = "СМ_НормативныеСборники" Тогда
		СМ_СметаВызовСервера.ЗаполнитьДанныеРесурса(Структура.Ресурс,Структура);
	ИначеЕсли Структура.ВариантЗамены = "СМ_Ресурсы" Тогда
		СМ_СметаВызовСервера.ПолучитьЦены(Структура.Ресурс, Структура.ПозицияРесурса, СтруктураЦен,СтруктураДопПараметров);
		Структура.БазисЦена = СтруктураЦен.БазиснаяЦена;
		Структура.БазисЗарплМаш = СтруктураЦен.БазиснаяЗарплатаМашинистов;
		Структура.ТекЦена = СтруктураЦен.ТекущаяЦена;
		Структура.ТекЗарплМаш = СтруктураЦен.ТекущаяЗарплатаМашинистов;
		Если Не СметнаяКомпонента = Неопределено Тогда
			Если СтруктураДопПараметров.АвтозагрузкаЦен = Истина И СтруктураДопПараметров.ФайлТекущихЦен <> "" Тогда
				СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,Структура.ПозицияРесурса);
				ДанныеЦен = СметнаяКомпонента.ПолучитьТекущиеЦены(СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Структура.Ресурс,"Код"), СтруктураПараметровРасчетаЛС.КодРайона, СтруктураПараметровРасчетаЛС.КодРегионаФайлаТекущихЦен, СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен);
				СМ_СметаВызовСервера.ПолучитьЦеныВНБ(ДанныеЦен,Структура.ТекЦена,Структура.ТекЗарплМаш);
			КонецЕсли;
		КонецЕсли;
		СМ_СметаВызовСервера.ЗаполнитьДанныеРесурса(Структура.Ресурс,Структура);
	Иначе
		СМ_СметаВызовСервера.ЗаполнитьДанныеРесурса(Структура.Данные,Структура);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВводРасходаРесурса", СМ_СметаКлиент,Новый Структура("Параметры,Форма",Структура,Форма));
	ОткрытьФорму("ОбщаяФорма.СМ_ВводРасходаРесурса",Структура,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

// Процедура заполняет данные по замене. 
//
// Параметры:
//     Структура - Струкрура - набор необходимых параметров.
//     Результат - Структура - набор параметров передаваемых общей формой СМ_ВводРасходаРесурса.
//
Процедура ВводРасходаРесурса(Результат, Структура) Экспорт
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат.Ресурс) = Тип("Строка") Тогда
		ЗаполнитьЗначенияСвойств(Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные,Структура.Параметры);
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.Наименование = Структура.Параметры.Наименование;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.НормаРасхода = Результат.РасходПоНорме;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.БазиснаяЦена = Результат.БазисЦена;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.ТекущаяЦена = Результат.ТекЦена;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.БазиснаяЗарплатаМашинистов = Результат.БазисЗарплМаш;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.ТекущаяЗарплатаМашинистов = Результат.ТекЗарплМаш;
	Иначе
		Если Структура.Параметры.Свойство("ВидРесурса") Тогда
			Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.ВидРесурса = Структура.Параметры.ВидРесурса; 
		КонецЕсли;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.Значение = Результат.Ресурс;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.Ресурс = Результат.Ресурс;
		Если ТипЗнч(Результат.Ресурс) = Тип("СправочникСсылка.СМ_Ресурсы") Тогда
			Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.Наименование = Структура.Параметры.Наименование;
		Иначе
			Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.Наименование = Результат.Ресурс;
		КонецЕсли;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.НормаРасхода = Результат.РасходПоНорме;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.БазиснаяЦена = Результат.БазисЦена;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.ТекущаяЦена = Результат.ТекЦена;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.БазиснаяЗарплатаМашинистов = Результат.БазисЗарплМаш;
		Структура.Форма.Элементы.ДеревоРесурсов.ТекущиеДанные.ТекущаяЗарплатаМашинистов = Результат.ТекЗарплМаш;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСметой

// Получает строку с информацией для вывода на формы документов.
//
// Параметры:
//     СтрокаДерева - Структура - содержит поля строки дерева смет.
//
// Возвращаемое значение:
//     об - ДокументСсылка - ссылка на элемент из строки дерева.
//
Функция ПолучитьСсылкуСтрокиДереваСмет(СтрокаДерева) Экспорт
	
	об = СтрокаДерева.Элемент;
	Возврат об;
	
КонецФункции

#КонецОбласти

#Область ПрочиеФункции

// Открывает диалог выбора каталога и устанавлевает выбранное значение в переданный параметр.
//
// Параметры:
//     Значение - Строка - значение для установки выбранного каталога.
//
// Возвращаемое значение:
//     Истина - каталог выбран, Ложь - в противном случае.
//
Функция сфВыборКаталога(Значение) Экспорт

	ДиалогВыбораКаталога 							= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.ПредварительныйПросмотр 	= Ложь;
	ДиалогВыбораКаталога.ИндексФильтра           	= 0;
	ДиалогВыбораКаталога.Каталог                 	= Значение;

	// Синхронный вызов
	//Если ДиалогВыбораКаталога.Выбрать() Тогда
	//	Значение = ?(Прав(ДиалогВыбораКаталога.Каталог,1)="\", ДиалогВыбораКаталога.Каталог, ДиалогВыбораКаталога.Каталог+"\");
	//	Возврат Истина;
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
	
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораКаталога", ЭтотОбъект,Значение);
	ДиалогВыбораКаталога.Показать(ОповещениеВыбора);

	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции 

// Выполняет действия после выбора каталога
//
// Параметры:
//    ВыбранныеФайлы 	- Массив - содержит выбранные имена каталогов или Неопределено, 
//								   если выбор не осуществлен. 
//	  Значение 			- Строка - значение для установки выбранного каталога.
//
Процедура ВыполнитьПослеВыбораКаталога(ВыбранныеФайлы,Значение) Экспорт
	
	Значение = "";
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			Значение = ?(Прав(ТекЭлемент,1)="\", ТекЭлемент, ТекЭлемент+"\");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Открывает диалог сохранения файла и устанавлевает выбранное значение в переданный параметр.
//
// Параметры:
//     Значение 				- Строка - полный путь к файлу для установки выбранного файла и каталога.
//	   Расширение             	- Строка - расширение файла.
//	   НазваниеФайла            - Строка - название файла. 
//     ПроверятьСуществование 	- Булево - если Истина, то выбор отменяется, если файл не существует.
//     Сохранение             	- Булево - если Истина, то диалог сохранения файла, иначе диалог открытия файла.
//
Процедура сфВыборФайла(Значение, Расширение, НазваниеФайла = "Файл данных", ПроверятьСуществование = Ложь, Сохранение = Ложь) Экспорт

	ДиалогФыбораФайла                             = Новый ДиалогВыбораФайла(?(Сохранение, РежимДиалогаВыбораФайла.Сохранение, РежимДиалогаВыбораФайла.Открытие));
	ДиалогФыбораФайла.Фильтр                      = НазваниеФайла+" (*."+Расширение+")|*."+Расширение;
	ДиалогФыбораФайла.Заголовок                   = НСтр("ru='Выберите файл'");
	ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогФыбораФайла.Расширение                  = Расширение;
	ДиалогФыбораФайла.ИндексФильтра               = 0;
	ДиалогФыбораФайла.ПолноеИмяФайла              = Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла = ПроверятьСуществование;

	// Синхронный вызов
	//Если ДиалогФыбораФайла.Выбрать() Тогда
	//	Значение = ДиалогФыбораФайла.ПолноеИмяФайла;
	//КонецЕсли;

	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект, Значение);
	ДиалогФыбораФайла.Показать(ОповещениеВыбора);
	
КонецПроцедуры

// Выполняет действия после выбора файла
//
// Параметры:
//    ВыбранныеФайлы 			- Массив - содержит выбранные имена файлов или Неопределено, 
//										   если выбор не осуществлен. 
//	  ДополнительныеПараметры	- Произвольный - содержит дополнительные параметры.
//
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			Значение = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает массив для дальнейших отборов.
// Если передан один объект, то просто добавляет его в массив.
//
// Параметры:
//     МассивОбъектов - ДокументСсылка, Массив - ссылка на документ или массив ссылок.
//
// Возвращаемое значение:
//     НовыйМассив - Массив - содержит нужные ссылки на элементы.
//
Функция ПодготовитьМассивОбъектов(МассивОбъектов) Экспорт
	
	НовыйМассив = Новый Массив; 
	
	Если ТипЗнч(МассивОбъектов) = тип("Массив") Тогда
		
		НовыйМассив = МассивОбъектов;
		
	ИначеЕсли типЗнч(МассивОбъектов) = тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		
		НовыйМассив.Добавить(МассивОбъектов);
			
	ИначеЕсли ТипЗнч(МассивОбъектов) = тип("ДокументОбъект.СМ_ПозицияЛокальнойСметы") Тогда
		
		НовыйМассив.Добавить(МассивОбъектов.Ссылка);
		
	Иначе
		Возврат неопределено; 
	КонецЕсли;

	Возврат  НовыйМассив;
	
КонецФункции

#КонецОбласти

#Область ВидимостьЭлементовМетодаРасчета

// Выводит строку с представлением метода расчета в форму.
//
// Параметры:
//     Форма - УправляемаяФорма - форма для которой выводится представление метода расчета.
//
Процедура ОтобразитьУровеньМетодРасчета(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект.МетодРасчета = ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.БазисноИндексный") Тогда
		Если Объект.Уровень = ПредопределенноеЗначение("Перечисление.СМ_УровеньЗаданияИндексов.Раздел") Тогда 
			
			Если Объект.СпособРасчетаИндексов = ПредопределенноеЗначение("Перечисление.СМ_СпособыРасчетаИндексов.КПолнойСтоимости") Тогда
				Элементы.ГруппаКомандПараметров.ПодчиненныеЭлементы.ВыбранВариант.Заголовок = НСтр("ru='Выбран базисно-индексный вариант по Разделам, по полной стоимости'");
			Иначе 	
				Элементы.ГруппаКомандПараметров.ПодчиненныеЭлементы.ВыбранВариант.Заголовок = НСтр("ru='Выбран базисно-индексный вариант по Разделам, по элементам затрат'");
			КонецЕсли;	
	
		ИначеЕсли Объект.Уровень = ПредопределенноеЗначение("Перечисление.СМ_УровеньЗаданияИндексов.Расценка") Тогда 
			
			Если Объект.СпособРасчетаИндексов = ПредопределенноеЗначение("Перечисление.СМ_СпособыРасчетаИндексов.КПолнойСтоимости") Тогда
				Элементы.ГруппаКомандПараметров.ПодчиненныеЭлементы.ВыбранВариант.Заголовок = НСтр("ru='Выбран Базисно-индексный вариант по Расценке по полной стоимости'");
			Иначе 	
				Элементы.ГруппаКомандПараметров.ПодчиненныеЭлементы.ВыбранВариант.Заголовок = НСтр("ru='Выбран Базисно-индексный вариант по Расценке по элементам затрат'");
			КонецЕсли;		
			
		ИначеЕсли Объект.Уровень = ПредопределенноеЗначение("Перечисление.СМ_УровеньЗаданияИндексов.Смета") Тогда 
			
			Если Объект.СпособРасчетаИндексов = ПредопределенноеЗначение("Перечисление.СМ_СпособыРасчетаИндексов.КПолнойСтоимости") Тогда
				Элементы.ГруппаКомандПараметров.ПодчиненныеЭлементы.ВыбранВариант.Заголовок = НСтр("ru='Выбран базисно-индексный вариант по Смете, по полной стоимости'");
			Иначе
				Элементы.ГруппаКомандПараметров.ПодчиненныеЭлементы.ВыбранВариант.Заголовок = НСтр("ru='Выбран базисно-индексный вариант по Смете, по элементам затрат'");
			КонецЕсли;
			
		Иначе
			
			Элементы.ГруппаКомандПараметров.ПодчиненныеЭлементы.ВыбранВариант.Заголовок = НСтр("ru='Выбран базисно-индексный вариант'");
					
		КонецЕсли;
	Иначе
		
		Элементы.ГруппаКомандПараметров.ПодчиненныеЭлементы.ВыбранВариант.Заголовок = НСтр("ru='Выбран Ресурсный вариант'");

	КонецЕсли;
	
	// Видимость элементов формы
	ЭтоРесурсныйМетод = Объект.МетодРасчета = ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.Ресурсный");
	ЭтоРасчетПоЭлементамЗатрат = Объект.СпособРасчетаИндексов = ПредопределенноеЗначение("Перечисление.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат");
	
	// в зависимости от метода счета
	Элементы.МетодРасчета.Видимость			= Истина;
	Элементы.Уровень.Видимость				= (Не ЭтоРесурсныйМетод) И ЗначениеЗаполнено(Объект.МетодРасчета);
	Элементы.СпособРасчетаИндексов.Видимость= (Не ЭтоРесурсныйМетод) И ЗначениеЗаполнено(Объект.Уровень);
	
	Элементы.ВариантПересчетаЭММ.Видимость	= (Не ЭтоРесурсныйМетод) И (ЭтоРасчетПоЭлементамЗатрат) И ЗначениеЗаполнено(Объект.Уровень);
	Элементы.ВариантРасчетаЗМ.Видимость     = ЭтоРесурсныйМетод;
	
	Элементы.ВариантРасчетаЗМ.АвтоОтметкаНезаполненного = (ЭтоРесурсныйМетод);
	Элементы.Уровень.АвтоОтметкаНезаполненного 			= (НЕ ЭтоРесурсныйМетод);
	Элементы.СпособРасчетаИндексов.АвтоОтметкаНезаполненного 			= (НЕ ЭтоРесурсныйМетод);
	
КонецПроцедуры

#КонецОбласти

#Область Формулы

// Производит расчет формулы, исходя из заданных в ней аргументов.
//
// Параметры:
//     Формула - Строка - содержит строку с формулой.
//
// Возвращаемое значение:
//     Формула - Число - содержит результат расчета.
//
Функция РасчитатьФормулу(Знач Формула) Экспорт
	
	ЛевСкобка = Найти(Формула,"(");
	Если НЕ ЛевСкобка = 0 Тогда
		
		ПравСкобка = 0;
		Для Сч = 0 По СтрДлина(Формула)-1 Цикл
			Если Сред(Формула,СтрДлина(Формула)-Сч,1) = ")"	Тогда
				ПравСкобка = СтрДлина(Формула)-Сч;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Результат = РасчитатьФормулу(Сред(Формула,ЛевСкобка+2,ПравСкобка - ЛевСкобка - 3));
		Формула = Лев(Формула,ЛевСкобка-1) + Результат + Прав(Формула,СтрДлина(Формула) - ПравСкобка);
		
	КонецЕсли;
	
	Умножение = Найти(Формула,"* ");
	Пока НЕ Умножение = 0 Цикл;
		Аргументы = НайтиАргументы(Формула, Умножение);
		Результат = Аргументы.Число1 * Аргументы.Число2;
		Формула = Лев(Формула,Аргументы.Число1Начало - 1) + Строка(Результат) + Прав(Формула,СтрДлина(Формула) - Аргументы.Число2Конец);
		
		Умножение = Найти(Формула,"* ");
	КонецЦикла;
	
	Деление = Найти(Формула,"/ ");
	Пока НЕ Деление = 0 Цикл;
		Аргументы = НайтиАргументы(Формула, Деление);
		Результат = Аргументы.Число1 / Аргументы.Число2;
		Формула = Лев(Формула,Аргументы.Число1Начало - 1) + Строка(Результат) + Прав(Формула,СтрДлина(Формула) - Аргументы.Число2Конец);
		
		Деление = Найти(Формула,"/ ");
	КонецЦикла;
	
	Вычитание = Найти(Формула,"- ");
	Пока НЕ Вычитание = 0 Цикл;
		Аргументы = НайтиАргументы(Формула, Вычитание);
		Результат = Аргументы.Число1 - Аргументы.Число2;
		Формула = Лев(Формула,Аргументы.Число1Начало - 1) + Строка(Результат) + Прав(Формула,СтрДлина(Формула) - Аргументы.Число2Конец);
		
		Вычитание = Найти(Формула,"- ");
	КонецЦикла;
	
	Сложение = Найти(Формула,"+ ");
	Пока НЕ Сложение = 0 Цикл;
		Аргументы = НайтиАргументы(Формула, Сложение);
		Результат = Аргументы.Число1 + Аргументы.Число2;
		Формула = Лев(Формула,Аргументы.Число1Начало - 1) + Строка(Результат) + Прав(Формула,СтрДлина(Формула) - Аргументы.Число2Конец);
		
		Сложение = Найти(Формула,"+ ");
	КонецЦикла;
	
	Попытка 
		Формула = Число(Формула);
	Исключение
		Формула = 0;
	КонецПопытки;
	
	Возврат Формула;
	
КонецФункции

#КонецОбласти

#Область ГрупповаяОбработкаПозиций

// Производит обновление по нормативной базе позиций из списка.
//
// Параметры:
//     МассивОбъектов 				- Массив - содержит ссылки на обновляемые позиции.
//     СтруктураПараметровРасчетаЛС - Структура - содержит данные о смете, полученная вызовом
//                                    ПолучитьСтруктуруПараметровРасчетаЛС().
//	   Найдено						- Булево - признак того, что в нормативной базе найдены данные по позиции.
//
Процедура ОбновитьПоНормативнойБазе(МассивОбъектов, СтруктураПараметровРасчетаЛС = Неопределено, Найдено = Ложь) Экспорт
	
	МассивПозиций = СМ_СметаВызовСервера.ПодготовитьМассивОбъектов(МассивОбъектов);
	МассивДляВсех = Новый Массив;	
	
	Для каждого ОбъектПозиции Из МассивПозиций Цикл
		
		Если (СтруктураПараметровРасчетаЛС = Неопределено) Тогда
			СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,ОбъектПозиции);
		КонецЕсли;
		
		Если ТипЗнч(ОбъектПозиции) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
			
			СтруктураКодНомерШифр = СМ_СметаВызовСервера.ПолучитьПараметрыДляОбновления(ОбъектПозиции,СтруктураПараметровРасчетаЛС);
			Если Строка(СтруктураКодНомерШифр.КодБазы) = "" Тогда
				Продолжить;
			КонецЕсли;	
			Данные = СметнаяКомпонента.ОбновитьПоБазе(СтруктураКодНомерШифр.ШифрРасценки,Строка(СтруктураПараметровРасчетаЛС.КодРайона),Строка(СтруктураКодНомерШифр.КодБазы),СтруктураКодНомерШифр.ТипСборника,Строка(СтруктураКодНомерШифр.НомерСборника));
			Если ЗначениеЗаполнено(Данные) И СМ_СметаЗагрузкаВызовСервера.ЕстьДанные(Данные) = Ложь Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Нет данных в нормативной базе по позиции %1. Позиция не обновлена.'"), СтруктураКодНомерШифр.ШифрРасценки));
				Найдено = Ложь;	
			Иначе	
				Если ЗначениеЗаполнено(Данные) Тогда
					Найдено = Истина;
					ОбъектПозиция = ОбъектПозиции; 
					СтруктураПараметровФормыВыбораВНБ = СМ_СметаВызовСервера.ОбновитьДанныеВПозицииЛС(Данные, ОбъектПозиция, Истина, СтруктураПараметровФормыВыбораВНБ, СтруктураПараметровРасчетаЛС, СМ_ВерсияКомпоненты);
					// ДокторСофт
					// Вставка текущих цен если отмечено.
					Если СтруктураПараметровРасчетаЛС.АвтозагрузкаЦен И ЗначениеЗаполнено(СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен) И (ОбъектПозиции <> Неопределено) Тогда
						// Обновляем индексы.
						СтруктураДанных = Новый Структура("СборникТекущихЦен, КодРегиональнойБазы", СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен, СтруктураПараметровРасчетаЛС.КодРегионаФайлаТекущихЦен);
						ДанныеИнд = СМ_СметаЗагрузкаКлиент.ПолучитьДанныеОТекущихЦенах(ОбъектПозиции, , СтруктураДанных);
						СМ_СметаВызовСервера.ЗагрузитьТекущиеЦеныВПозиции(ОбъектПозиции, ДанныеИнд, Истина,  СтруктураПараметровРасчетаЛС.МетодРасчета = ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.Ресурсный"));
					КонецЕсли;

					// Вставка индексов если БИ по позициям.
					Если (СтруктураПараметровРасчетаЛС.МетодРасчета = ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.БазисноИндексный") И СтруктураПараметровРасчетаЛС.Уровень = ПредопределенноеЗначение("Перечисление.СМ_УровеньЗаданияИндексов.Расценка")) Тогда
						Если СтруктураПараметровРасчетаЛС.АвтозагрузкаИндексов И ЗначениеЗаполнено(СтруктураПараметровРасчетаЛС.ФайлСборникаКоэффициентов) И (ОбъектПозиции <> Неопределено) Тогда
							// Обновляем индексы.
							СтруктураДанных = Новый Структура("СборникКоэффициентов", СтруктураПараметровРасчетаЛС.ФайлСборникаКоэффициентов);
							Если СтруктураПараметровРасчетаЛС.ПрименятьИндексыКоВсемБазам Тогда
								СтруктураДанных.Вставить("КодРегиональнойБазы", СтруктураПараметровРасчетаЛС.КодРегионаФайлаИндексовПересчета);
							КонецЕсли;
							ДанныеИнд = СМ_СметаЗагрузкаКлиент.ПолучитьДанныеОбИндексахПересчета(ОбъектПозиции, , СтруктураДанных);
							СМ_СметаВызовСервера.ЗагрузитьИндексыВПозиции(ОбъектПозиции, ДанныеИнд, СтруктураПараметровРасчетаЛС.ВариантПересчетаЭММ, Истина, Истина,);	
						КонецЕсли;
					КонецЕсли;
					// ДокторСофт
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
	СМ_СметаКлиент.ОткрытьФормуПодбораНеучтенныхРесурсов(СтруктураПараметровФормыВыбораВНБ);
	
КонецПроцедуры	

// Производит обновление позиции по норме
//
// Параметры:
//     ОбъектПозиции 	- ДокументОбъект.СМ_ПозицияЛокальнойСметы - объект позиции для обновления.
//     Данные 			- Структура - данные полученные из ВНБ. 
//
Процедура ОбновитьПозициюПоНорме(ОбъектПозиции,Данные) Экспорт
	
	СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,ОбъектПозиции);
	
	ОбъектПозиция = ОбъектПозиции; 
	СтруктураПараметровФормыВыбораВНБ = СМ_СметаВызовСервера.ОбновитьДанныеВПозицииЛС(Данные, ОбъектПозиция, Истина, СтруктураПараметровФормыВыбораВНБ, СтруктураПараметровРасчетаЛС, СМ_ВерсияКомпоненты);
	// Вставка текущих цен если отмечено.
	Если СтруктураПараметровРасчетаЛС.АвтозагрузкаЦен И ЗначениеЗаполнено(СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен) И (ОбъектПозиции <> Неопределено) Тогда
		// Обновляем индексы.
		СтруктураДанных = Новый Структура("СборникТекущихЦен, КодРегиональнойБазы", СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен, СтруктураПараметровРасчетаЛС.КодРегионаФайлаТекущихЦен);
		ДанныеИнд = СМ_СметаЗагрузкаКлиент.ПолучитьДанныеОТекущихЦенах(ОбъектПозиции, , СтруктураДанных);
		СМ_СметаВызовСервера.ЗагрузитьТекущиеЦеныВПозиции(ОбъектПозиции, ДанныеИнд, Истина,  СтруктураПараметровРасчетаЛС.МетодРасчета = ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.Ресурсный"));
	КонецЕсли;
	
	// Вставка индексов если БИ по позициям.
	Если (СтруктураПараметровРасчетаЛС.МетодРасчета = ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.БазисноИндексный") И СтруктураПараметровРасчетаЛС.Уровень = ПредопределенноеЗначение("Перечисление.СМ_УровеньЗаданияИндексов.Расценка")) Тогда
		Если СтруктураПараметровРасчетаЛС.АвтозагрузкаИндексов И ЗначениеЗаполнено(СтруктураПараметровРасчетаЛС.ФайлСборникаКоэффициентов) И (ОбъектПозиции <> Неопределено) Тогда
			// Обновляем индексы.
			СтруктураДанных = Новый Структура("СборникКоэффициентов", СтруктураПараметровРасчетаЛС.ФайлСборникаКоэффициентов);
			Если СтруктураПараметровРасчетаЛС.ПрименятьИндексыКоВсемБазам Тогда
				СтруктураДанных.Вставить("КодРегиональнойБазы", СтруктураПараметровРасчетаЛС.КодРегионаФайлаИндексовПересчета);
			КонецЕсли;
			ДанныеИнд = СМ_СметаЗагрузкаКлиент.ПолучитьДанныеОбИндексахПересчета(ОбъектПозиции, , СтруктураДанных);
			СМ_СметаВызовСервера.ЗагрузитьИндексыВПозиции(ОбъектПозиции, ДанныеИнд, СтруктураПараметровРасчетаЛС.ВариантПересчетаЭММ, Истина, Истина,);	
		КонецЕсли;
	КонецЕсли;
	
	СМ_СметаКлиент.ОткрытьФормуПодбораНеучтенныхРесурсов(СтруктураПараметровФормыВыбораВНБ);
	
КонецПроцедуры

// Производит обновление по нормативной базе позиций из списка.
//
// Параметры:
//     МассивОбъектов 				- Массив - содержит ссылки на обновляемые позиции.
//     СтруктураПараметровРасчетаЛС - Структура - содержит данные о смете, полученная вызовом
//                                    ПолучитьСтруктуруПараметровРасчетаЛС().
//	   Найдено						- Булево - признак того, что в нормативной базе найдены данные по позиции.
//
Процедура ОбновитьЗагружаемыеПозицииПоНормативнойБазе(МассивОбъектов, СтруктураПараметровРасчетаЛС = Неопределено, Найдено = Ложь) Экспорт
	
	
	МассивПозиций = СМ_СметаВызовСервера.ПодготовитьМассивОбъектов(МассивОбъектов);
	МассивДляВсех = Новый Массив;	
	
	Для каждого ОбъектПозиции Из МассивПозиций Цикл
		
		Если (СтруктураПараметровРасчетаЛС = Неопределено) Тогда
			СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,ОбъектПозиции);
		КонецЕсли;
		
		Если ТипЗнч(ОбъектПозиции) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
			
			СтруктураКодНомерШифр = СМ_СметаВызовСервера.ПолучитьПараметрыДляОбновления(ОбъектПозиции,СтруктураПараметровРасчетаЛС);
			Если Строка(СтруктураКодНомерШифр.КодБазы) = "" Тогда
				Продолжить;
			КонецЕсли;	
			Данные = СметнаяКомпонента.ОбновитьПоБазе(СтруктураКодНомерШифр.ШифрРасценки,Строка(СтруктураПараметровРасчетаЛС.КодРайона),Строка(СтруктураКодНомерШифр.КодБазы),СтруктураКодНомерШифр.ТипСборника,Строка(СтруктураКодНомерШифр.НомерСборника));
			Если ЗначениеЗаполнено(Данные) И СМ_СметаЗагрузкаВызовСервера.ЕстьДанные(Данные) = Ложь Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Нет данных в нормативной базе по позиции %1. Позиция не обновлена.'"), СтруктураКодНомерШифр.ШифрРасценки));
				Найдено = Ложь;	
			Иначе	
				Если ЗначениеЗаполнено(Данные) Тогда
					Найдено = Истина;
					ОбъектПозиция = ОбъектПозиции; 
					СтруктураПараметровФормыВыбораВНБ = СМ_СметаВызовСервера.ОбновитьДанныеВПозицииЛС(Данные, ОбъектПозиция,Ложь, СтруктураПараметровФормыВыбораВНБ, СтруктураПараметровРасчетаЛС, СМ_ВерсияКомпоненты);
					// ДокторСофт
					// Вставка текущих цен если отмечено.
					Если СтруктураПараметровРасчетаЛС.АвтозагрузкаЦен И ЗначениеЗаполнено(СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен) И (ОбъектПозиции <> Неопределено) Тогда
						// Обновляем индексы.
						СтруктураДанных = Новый Структура("СборникТекущихЦен, КодРегиональнойБазы", СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен, СтруктураПараметровРасчетаЛС.КодРегионаФайлаТекущихЦен);
						ДанныеИнд = СМ_СметаЗагрузкаКлиент.ПолучитьДанныеОТекущихЦенах(ОбъектПозиции, , СтруктураДанных);
						СМ_СметаВызовСервера.ЗагрузитьТекущиеЦеныВПозиции(ОбъектПозиции, ДанныеИнд, Истина,  СтруктураПараметровРасчетаЛС.МетодРасчета = ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.Ресурсный"));
					КонецЕсли;

					// Вставка индексов если БИ по позициям.
					Если (СтруктураПараметровРасчетаЛС.МетодРасчета = ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.БазисноИндексный") И СтруктураПараметровРасчетаЛС.Уровень = ПредопределенноеЗначение("Перечисление.СМ_УровеньЗаданияИндексов.Расценка")) Тогда
						Если СтруктураПараметровРасчетаЛС.АвтозагрузкаИндексов И ЗначениеЗаполнено(СтруктураПараметровРасчетаЛС.ФайлСборникаКоэффициентов) И (ОбъектПозиции <> Неопределено) Тогда
							// Обновляем индексы.
							СтруктураДанных = Новый Структура("СборникКоэффициентов", СтруктураПараметровРасчетаЛС.ФайлСборникаКоэффициентов);
							Если СтруктураПараметровРасчетаЛС.ПрименятьИндексыКоВсемБазам Тогда
								СтруктураДанных.Вставить("КодРегиональнойБазы", СтруктураПараметровРасчетаЛС.КодРегионаФайлаИндексовПересчета);
							КонецЕсли;
							ДанныеИнд = СМ_СметаЗагрузкаКлиент.ПолучитьДанныеОбИндексахПересчета(ОбъектПозиции, , СтруктураДанных);
							СМ_СметаВызовСервера.ЗагрузитьИндексыВПозиции(ОбъектПозиции, ДанныеИнд, СтруктураПараметровРасчетаЛС.ВариантПересчетаЭММ, Истина, Истина,);	
						КонецЕсли;
					КонецЕсли;
					// ДокторСофт
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Найти аргументы в формуле.
Функция НайтиАргументы(Формула, ПозЗнака)
	
	Число1 = 0;
	Число1Начало = 0;
	Число2 = 0;
	Число2Конец = 0;
	
	Для Сч = 2 По ПозЗнака Цикл
		Если Сред(Формула, ПозЗнака - Сч,1) = " " Тогда
			Число1 = Сред(Формула,ПозЗнака - Сч + 1, Сч - 2);
			Число1Начало = ПозЗнака - Сч + 1;
			Прервать;
		КонецЕсли;
		Число1 = Лев(Формула, Сч - 2);
		Число1Начало = 1;
		
	КонецЦикла;
	Для Сч = 2 По СтрДлина(Формула) - ПозЗнака Цикл
		Если Сред(Формула, ПозЗнака + Сч,1) = " " Тогда
			Число2 = Сред(Формула,ПозЗнака + 2, Сч - 2);
			Число2Конец = ПозЗнака + Сч - 1;
			Прервать;
		КонецЕсли;
		Число2 = Прав(Формула, Сч - 1);
		Число2Конец = СтрДлина(Формула);
	КонецЦикла;
	
	Аргументы = Новый Структура("Число1,Число2,Число1Начало,Число2Конец",Число(Число1),Число(Число2),Число1Начало,Число2Конец);
	
	Возврат Аргументы;
	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Предложение загрузить данные из других систем

Процедура ПредложитьЗагрузитьДанныеИзДругихСистем() Экспорт
	
	// ОткрытьФорму("Обработка.СМ_ПереходНаСмета3_0Смета2_3.Форма.Форма");.
	
КонецПроцедуры

#КонецОбласти
